# Домашнее задание модуля 1

1. При помощи цикла for посчитать количество единиц в массиве int[]:
- Пример массива int[] arr = {1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0};
- Использовать цикл for 
- Использовать оператор if
- Пример кода: 
``` java
int count1 = 0;
for (int i = 0; i < arr.length; i ++) {
  if (arr[i] == 1) {
    count1 = count1 + 1;
  }
}
System.out.println("Count: " + count1);
```
2. Посчитать по аналогии количество нулей в этом же массиве
3. Найти максимальное число в массиве int[] arr = {100, 23, 45, 109, 244, 456,231}; при помощи цикла for
- Использовать цикл for 
- Использовать переменную для хранения максимального элемента 
- Использовать оператор if для определения максимального числа
- Пример кода:
``` java
int max = 0;
for (int i = 0; i < arr.length; i ++) {
   if (max < arr[i]) {
      max = arr[i];
   }
}
System.out.println("Max: " + max);
```
4. По аналогии с (3) найти минимальное число в этом же массиве.
5. Самостоятельно написать программу с использованием цикла for для вычисления количества нечетных чисел в массиве {123, 45, 22, 2, 11, 23, 16, 29, 10}
- Для того чтобы понять, что число четное необходимо использовать оператор if с условиием (arr[i] % 2 == 0)
- Оператор % позволяет получить остаток от деления на число (если число четное, то при делении на 2 остатка не будет)
6. Самостоятельно написать программу для вычисления произведения чисел в массиве {123, 45, 22, 2, 11, 23, 89, 67, 11, 12, 90, 56} с использованием цикла for.
